Revit 2026 API

# PipeFittingAndAccessoryData Class

---

The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.

SystemObject Autodesk.Revit.DB.PlumbingPipeFittingAndAccessoryData

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeFittingAndAccessoryData : IDisposable
```
```vb
Public Class PipeFittingAndAccessoryData
	Implements IDisposable
```
```cpp
public ref class PipeFittingAndAccessoryData : IDisposable
```
```fsharp
type PipeFittingAndAccessoryData =
    class
        interface IDisposable
    end
```

The PipeFittingAndAccessoryData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BehaviorType | The behavior type of the pipe fitting or pipe accessory. |
|  | FluidDensity | The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³). |
|  | FluidViscosity | The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Origin | The origin position of the pipe fitting or pipe accessory. |
|  | PartType | The part type of the pipe fitting or pipe accessory. |
|  | ServerGUID | The GUID of the pipe fitting or pipe accessory. |
|  | SystemClassification | The system classification of the pipe fitting or pipe accessory. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PipeFittingAndAccessoryData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAllConnectorData | Gets the connector data of the pipe fitting or pipe accessory. |
|  | GetEntity | Returns an Entity of the Schema of the serverGUID. |
|  | GetFamilyInstanceId | Gets the Id of the fiting or accessory instance |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

A FamilyInstance is the input data for the calculation, and the result is coefficient for each connector.

#### Reference

Autodesk.Revit.DB.Plumbing Namespace